Repository: pypi-data/pypi-mirror-97
Catalog: packages/django-jutil/django-jutil-3.8.4.tar.gz/django-jutil-3.8.4/jutil/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Change history: %s
fi: Muutoshistoria: %s

source: last month
fi: edellinen kuukausi

source: last year
fi: edellinen vuosi

source: this month
fi: tämä kuukausi

source: this year
fi: tämä vuosi

source: last week
fi: edellinen viikko

source: this week
fi: tämä viikko

source: yesterday
fi: eilinen päivä

source: today
fi: tämä päivä

source: number.of.days
fi: päivää

source: daily
fi: päivittäin

source: weekly
fi: viikottain

source: monthly
fi: kuukausittain

source: Invalid email recipient: {}
fi: Epäkelpo sähköposti: {}

source: %(value)s is not one of the available choices
fi: %(value)s ei ole yksi valittavissa olevista arvoista

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
fi: %(value)s-arvon muoto ei kelpaa. Se tulee olla VVVV-KK-PP TT:MM[:ss[.uuuuuu]]

source: File {} not found
fi: Tiedostoa {} ei löydy

source: Invalid phone number
fi: Epäkelpo puhelinnumero

source: Invalid passport number
fi: Epäkelpo passin numero

source: Invalid country code
fi: Epäkelpo maakoodi

source: Invalid company organization ID
fi: Epäkelpo yrityksen tunnus

source: Invalid IBAN account number
fi: Epäkelpo IBAN-tilinumero

source: Invalid personal identification number
fi: Epäkelpo henkilötunnus

source: Invalid bank BIC/SWIFT code
fi: Epäkelpo pankin BIC/SWIFT koodi

source: action time
fi: tapahtuman aika

source: Missing value
fi: Puuttuva arvo

source: IBAN checksum generation does not support >26 character IBANs
fi: IBAN tarkistussumman generointi ei tue yli 26 merkkisiä IBANeja

source: Invalid email
fi: Epäkelpo sähköposti

source: Invalid payment reference: {}
fi: Epäkelpo maksuviite: {}
