Repository: pypi-data/pypi-mirror-97
Catalog: packages/m9s-stock-update-planned-date/m9s_stock_update_planned_date-5.2.2-py3-none-any.whl/trytond/modules/stock_update_planned_date/locale/*.po
Languages: de, es_es

# field:stock.configuration,update_move_in:
source: Update Planned Dates of Purchase Moves
de: Geplantes Datum von Lagerbewegungen aus Einkäufen aktualisieren
es_es: Actualizar fecha prevista de movimientos de compra

# field:stock.configuration,update_move_out:
source: Update Planned Dates of Sales Moves
de: Geplantes Datum von Lagerbewegungen aus Verkäufen aktualisieren
es_es: Actualizar fecha prevista de movimientos de venta

# field:stock.configuration,update_move_shipment:
source: Update Planned of Dates Moves
es_es: Actualizar fecha prevista de movimientos

# field:stock.configuration,update_shipment_in:
source: Update Planned Dates of Supplier Shipments
de: Geplantes Datum von Lieferposten von Lieferanten aktualisieren
es_es: Actualizar fecha prevista de albaranes proveedor

# field:stock.configuration,update_shipment_internal:
source: Update Planned Dates of Internal Shipments
de: Geplantes Datum von Internen Lieferposten aktualisieren
es_es: Actualizar fecha prevista de albaranes internos

# field:stock.configuration,update_shipment_out:
source: Update Planned Dates of Customer Shipments
de: Geplantes Datum von Lieferposten an Kunden aktualisieren
es_es: Actualizar fecha prevista de albaranes de cliente

# field:stock.update.planned.date.start,date:
source: Date
de: Datum
es_es: Fecha

# model:ir.action,name:wizard_update_planned_date
source: Update Planned Date
de: Geplantes Datum aktualisieren
es_es: Actualizar fecha prevista

# model:ir.cron,name:
source: Update Shipment Out Planned Date
es_es: Actualizar fecha prevista albaranes cliente

# model:ir.cron,name:cron_update_planned_date_scheduler
source: Update Planned Date
es_es: Actualizar fecha prevista

# model:ir.ui.menu,name:menu_update_planned_date
source: Update Planned Date
de: Geplantes Datum aktualisieren
es_es: Actualizar fecha prevista

# model:stock.update.planned.date.start,name:
source: Update Planned Date Start
de: Aktualisierung Geplantes Datum Start
es_es: Inicio actualizar fecha prevista

# view:stock.configuration:
source: Update Planned Date
de: Aktualisierung Geplantes Datum
es_es: Actualizar fecha prevista

# view:stock.update.planned.date.start:
source: Update Planned Date
es_es: Actualizar fecha prevista

# view:stock.update.planned.date.start:
source: Update Planned Date to
de: Geplantes Datum aktualisieren zu
es_es: Actualizar fecha prevista a

# wizard_button:stock.update.planned.date,start,end:
source: Cancel
de: Abbrechen
es_es: Cancelar

# wizard_button:stock.update.planned.date,start,update_planned_date:
source: OK
es_es: Aceptar

# field:stock.configuration,update_move_shipment:
source: Update Planned Dates of All Shipment Moves
de: Geplantes Datum der Lagerbewegungen auf Lieferposten aktualisieren

# selection:ir.cron,method:
source: Update Planned Date
de: Geplantes Datum aktualisieren
