Repository: pypi-data/pypi-mirror-97
Catalog: packages/pyams-layer/pyams_layer-1.1.1-py3.9.egg/pyams_layer/locales/*/LC_MESSAGES/pyams_layer.po
Languages: fr

source: PyAMS base skin
fr: Thème de base PyAMS

source: Inherit parent skin?
fr: Hériter du thème du parent ?

source: Should we reuse parent skin?
fr: Si 'oui', le même thème que celui du niveau parent sera utilisé

source: Don't inherit parent skin?
fr: Ne pas hériter du thème du parent ?

source: Should we override parent skin?
fr: Si 'non', le même thème que celui du niveau parent sera utilisé

source: Custom graphic theme
fr: Choisir un thème spécifique

source: This theme will be used to handle graphic design (colors and images)
fr: Ce thème sera utilisé pour prendre en charge le modèle de présentation des pages affichées dans ce contexte (palette de couleurs, images...)

source: Custom stylesheet
fr: Feuille de style personnalisée

source: This custom stylesheet will be used to override selected theme styles
fr: Cette feuille de style pourra être utilisée pour surcharger les styles graphiques fournis par le thème graphique sélectionné

source: Editor stylesheet
fr: Feuille de style éditeur HTML

source: Styles defined into this stylesheet will be available into HTML editor
fr: Si vous souhaitez mettre à disposition des rédacteurs une sélection de styles spécifiques, vous pouvez les définir dans cette feuille de style et ils seront accessibles au sein des éditeurs HTML ; consultez la documentation pour connaître les contraintes qui s'appliquent

source: Custom script
fr: Script additionnel

source: This custom javascript file will be used to add dynamic features to selected theme
fr: Ce fichier javascript pourra ajouter des fonctionnalités supplémentaires à celles proposées par le thème graphique sélectionné

source: You must select a custom skin or inherit from parent!
fr: Vous devez choisir un thème spécifique ou hériter de celui du niveau parent
