Repository: pypi-data/pypi-mirror-97
Catalog: packages/m9s-sale-kit/m9s_sale_kit-5.2.1-py3-none-any.whl/trytond/modules/sale_kit/locale/*.po
Languages: de

# field:product.product,components_in_description:
source: Components in description
de: Komponenten in Beschreibung

# field:product.product,explode_kit_in_sales:
source: Expand components in sales
de: Komponenten in Verkäufen expandieren

# field:sale.line,kit_child_lines:
source: Kit Components
de: Komponenten

# field:sale.line,kit_depth:
source: Depth
de: Tiefe

# field:sale.line,kit_parent_line:
source: Parent Sale Line
de: Übergeordnete Zeile (Kit)

# help:product.product,components_in_description:
source: When activated, the components of the kit will be added to the sale line description.
de: Bei Aktivierung werden die Komponenten des Kits zur Beschreibung der Verkaufsposition hinzugefügt.

# help:product.product,explode_kit_in_sales:
source: When activated, the components of the kit will be added as individual sale lines with their relative unit price and the kit itself will have set its unit price to 0.
de: Bei Aktivierung werden die Komponenten des Kits als individuelle Verkaufspositionen mit ihrem jeweiligen Einzelpreis hinzugefügt und der Preis des Kits wird auf 0 gesetzt.

# help:sale.line,kit_child_lines:
source: The components of the kit
de: Die Komponenten des Kits

# help:sale.line,kit_depth:
source: Depth of the line if it is part of a kit.
de: Tiefe der Zeile, wenn sie Teil eines Kits ist

# help:sale.line,kit_parent_line:
source: The sale line that contains this product.
de: Das Kit, das diesen Artikel enthält

# model:ir.message,text:customer_location_required
source: For the customer of sale line "%(line)s" on sale "%(sale)s" there is no customer location defined.
de: Für den Kunden von Verkaufsposition "%(line)s" in Verkauf "%(sale)s" ist kein Kundenlagerort definiert.

# model:ir.message,text:kit_not_purchasable
source: The kit "%s" is marked as purchasable, but kits can not be purchasable.
de: Kit "%s" ist als käuflich markiert, aber Kits können nicht käuflich sein.

# model:ir.message,text:salable_lines_required
source: The components of a kit with the flag "Explode in Sales" checked must be "salable".
de: Die Komponenten eines Kits mit "Komponenten in Verkäufen expandieren" müssen verkäuflich sein.

# model:ir.message,text:salable_product_required_in_kit
source: The kit "%s" has the flag "Explode in Sales" checked. All of its components must be "salable", but not all are configured this way.
de: Das Kit "%s" ist mit "Komponenten bei Verkauf expandieren" ausgestattet. Alle Komponenten dieses Kits müssen verkäuflich sein, aber nicht alle sind so konfiguriert.
