Repository: pypi-data/pypi-mirror-97
Catalog: packages/m9s-nereid-webshop-elastic-search/m9s_nereid_webshop_elastic_search-5.2.1.tar.gz/m9s_nereid_webshop_elastic_search-5.2.1/locale/*.po
Languages: de

# field:product.attribute,display_count:
source: Display Counts
de: Trefferzahl anzeigen

# field:product.attribute,display_order:
source: Display Order
de: Anzeigesortierung

# field:product.attribute,display_size:
source: Display Size
de: Anzeigegröße

# field:product.attribute,filterable:
source: Filterable
de: Facettierte Suche

# field:product.attribute,multiselect:
source: Multi Select
de: Mehrfachauswahl

# help:product.attribute,display_count:
source: Display the number of matching products with the filter
de: Die Anzahl der zutreffenden Varianten mit dem Filter anzeigen

# help:product.attribute,display_size:
source: Number of top N matching values to be displayed.
de: Anzahl zutreffender Produkte, die angezeigt werden soll

# help:product.attribute,filterable:
source: Makes the attribute filterable in faceted navigation
de: Das Attribut in der facettierten Suche verfügbar machen

# help:product.attribute,multiselect:
source: Allow selecting multiple values to filter the attribute
de: Mehrere Werte bei der Filterausahl erlauben

# selection:product.attribute,display_order:
source: No. of matching products (ASC)
de: Anzahl zutreffender Produkte (Aufsteigend)

# selection:product.attribute,display_order:
source: No. of matching products (DESC)
de: Anzahl zutreffender Produkte (Absteigend)

# selection:product.attribute,display_order:
source: Value of attribute (ASC)
de: Wert des Attributs (Aufsteigend)

# selection:product.attribute,display_order:
source: Value of attribute (DESC)
de: Wert des Attributs (Absteigend)

# view:product.attribute:
source: Additional Settings
de: Website
