Repository: pypi-data/pypi-mirror-97
Catalog: packages/django-password-policies-iplweb/django_password_policies_iplweb-0.8.3-py3-none-any.whl/password_policies/locale/*/LC_MESSAGES/django.po
Languages: es

source: Force password change for selected users
es: Fuerza el cambio de contraseña para los usuarios seleccionados

source: created
es: creado

source: The date the entry was created.
es: La fecha en que se creó la entrada.

source: user
es: usuario

source: The user who needs to change his/her password.
es: El usuario que necesita cambiar su contraseña.

source: enforced password change
es: cambio de contraseña forzada

source: enforced password changes
es: cambios de contraseña forzada

source: password
es: contraseña

source: The encrypted password.
es: La contraseña cifrada.

source: The user this password history entry belongs to.
es: El usuario de esta entrada en el historial de contraseñas pertenece a.

source: password history entry
es: entrada en el historial de contraseñas

source: password history entries
es: entradas en el historial de contraseñas

source: The two password fields didn't match.
es: Las dos contraseñas no son iguales.

source: The new password was used before. Please enter another one.
es: La contraseña nueva fue usada antes. Por favor escriba otra nueva.

source: New password
es: Nueva contraseña

source: New password confirmation
es: Confirmación de contraseña nueva

source: Your old password was entered incorrectly. Please enter it again.
es: Su contraseña anterior es incorrecta. Por favor, escríbala de nuevo

source: The old and the new password are too similar.
es: La contraseña anterior y la nueva son demasiado parecidas.

source: The old and the new password are the same.
es: La contraseña anterior es la misma que la contraseña nueva

source: Old password
es: Contraseña anterior

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
es: Este e-mail no tiene una cuenta de usuario asociada. ¿Seguro que está registrado?

source: The user account associated with this e-mail address cannot reset the password.
es: La cuenta de usuario asociada a este e-mail no puede cambiar la contraseña.

source: A user with that username already exists.
es: Ya existe un usuario con ese nombre de usuario.

source: Username
es: Nombre de usuario

source: Required. 30 characters or fewer. Letters, digits and @/./+/-/_ only.
es: Obligatorio. 30 caracteres o menos. Sólo letras, dígitos y @/./+/-/_

source: This value may contain only letters, numbers and @/./+/-/_ characters.
es: Este valor sólo puede contener letras, números y los caracteres @/./+/-/_

source: Password
es: Contraseña

source: Password confirmation
es: Confirmación de contraseña

source: Enter the same password as above, for verification.
es: Introduzca la misma contraseña que el anterior, para verificación.

source: Password new
es: Contraseña nueva

source: Must change?
es: ¿Debe cambiar?

source: The new password contains ambiguous bidirectional characters.
es: La contraseña nueva contiene caracteres bidireccionales ambiguos.

source: The new password is based on a common sequence of characters.
es: La contraseña nueva está basada en una secuencia común de caracteres.

source: The new password contains consecutive characters. Only %(count)d consecutive character is allowed.
es: La contraseña nueva contiene caracteres consecutivos. Sólo se permite %(count)d carácter consecutivo.

source: Please choose a different password, %s.
es: Por favor escoja una contraseña diferente, %s.

source: The new password is not varied enough.
es: La contraseña nueva no es lo suficientemente variada.

source: The new password is based on a dictionary word.
es: La contraseña nueva se basa en una palabra del diccionario.

source: The new password contains invalid unicode characters.
es: La contraseña nueva contiene caractes unicode inválidos.

source: The new password must contain %d or more letter.
es: La contraseña nueva debe contener %d o más letras.

source: The new password is similar to an email address.
es: La contraseña nueva es similar a una dirección de e-mail.

source: The new password must contain %d or more number.
es: La contraseña nueva debe contener %d o más números.

source: The new password must contain %d or more symbol.
es: La contraseña nueva debe contener %d o más símbolos.
