Repository: pypi-data/pypi-mirror-97
Catalog: packages/pyams-utils/pyams_utils-1.7.0-py3.7.egg/pyams_utils/locales/*/LC_MESSAGES/pyams_utils.po
Languages: fr

source: Item value
fr: Contenu de l'élément.

source: Range beginning date
fr: Date de début

source: Range ending date (excluded)
fr: Date de fin (exclue)

source: Automatic detection
fr: Détection automatique

source: 0 bytes
fr: 0 octets

source: 0.# Kb
fr: 0.# Ko

source: 0.0# Mb
fr: 0.0# Mo

source: 0.0## Gb
fr: 0.0## Go

source: Color length must be 3 or 6 characters
fr: La longueur du code couleur doit être de 3 ou 6 caractères.

source: Color value must contain only valid hexadecimal color codes (numbers or letters between 'A' end 'F')
fr: Le code couleur ne doit contenir que des caractères hexadécimaux (des chiffres, ou des lettres entre 'A' et 'F')

source: Email address must be entered as « name@domain.name », without '<' and '>' characters
fr: L'adresse mail doit être saisie sous la forme « nom@domain.org », sans les caractères '<' et '>'.

source: on %d/%m/%Y
fr: le %d/%m/%Y

source: on %d/%m/%Y at %H:%M
fr: le %d/%m/%Y à %H:%M

source: %d months ago
fr: il y a %d mois

source: %d weeks ago
fr: il y a %d semaines

source: %d days ago
fr: il y a %d jours

source: the day before yesterday
fr: avant-avant-hier

source: yesterday
fr: hier

source: %d hours ago
fr: il y a %d heures

source: %d minutes ago
fr: il y a %d minutes

source: less than 5 minutes ago
fr: il y a moins de 5 minutes

source: %d months
fr: %d mois

source: %d weeks
fr: %d semaines

source: %d days
fr: %d jours

source: 24 hours
fr: 24 heures

source: %d day and %d hours
fr: %d jours et %d heures

source: %d hours
fr: %d heures

source: %d seconds
fr: %d secondes

source: English (ASCII)
fr: Anglais (ASCII)

source: Traditional Chinese (big5)
fr: Chinois traditionnel (big5)

source: Traditional Chinese (big5hkscs)
fr: Chinois traditionnel (big5hkscs)

source: English (cp037)
fr: Anglais (cp037)

source: Hebrew (cp424)
fr: Hébreu (cp424)

source: English (cp437)
fr: Anglais (cp437)

source: Western Europe (cp500)
fr: Europe de l'ouest (cp500)

source: Arabic (cp720)
fr: Arabe (cp720)

source: Greek (cp737)
fr: Grec (cp737)

source: Baltic languages (cp775)
fr: Langues baltes (cp775)

source: Western Europe (cp850)
fr: Europe de l'ouest (cp850)

source: Central and Eastern Europe (cp852)
fr: Europe centrale et de l'est (cp852)

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian (cp855)
fr: Bulgare, Biélorusse, Macédonien, Russe, Serbe (cp855)

source: Hebrew (cp856)
fr: Hébreu (cp856)

source: Turkish (cp857)
fr: Turc (cp857)

source: Western Europe (cp858)
fr: Europe de l'ouest (cp858)

source: Portuguese (cp860)
fr: Portugais (cp860)

source: Icelandic (cp861)
fr: Islandais (cp861)

source: Hebrew (cp862)
fr: Hébreu (cp862)

source: Canadian (cp863)
fr: Canadien (cp863)

source: Arabic (cp864)
fr: Arabe (cp864)

source: Danish, Norwegian (cp865)
fr: Danois, Norvégien (cp865)

source: Russian (cp866)
fr: Russe (cp866)

source: Greek (cp869)
fr: Grec (cp869)

source: Thai (cp874)
fr: Thaï (cp874)

source: Greek (cp875)
fr: Grec (cp875)

source: Japanese (cp932)
fr: Japonais (cp932)

source: Korean (cp949)
fr: Coréen (cp949)

source: Traditional Chinese (cp950)
fr: Chinois traditionnel (cp950)

source: Turkish (cp1026)
fr: Turc (cp1026)

source: Western Europe (cp1140)
fr: Europe de l'ouest (cp1140)

source: Central and Eastern Europe (cp1250)
fr: Europe centrale et de l'est (cp1250)

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian (cp1251)
fr: Bulgare, Biélorusse, Macédonien, Russe, Serbe (cp1251)

source: Western Europe (cp1252)
fr: Europe de l'ouest (cp1252)

source: Greek (cp1253)
fr: Grec (cp1253)

source: Turkish (cp1254)
fr: Turc (cp1254)

source: Hebrew (cp1255)
fr: Hébreu (cp1255)

source: Arabic (cp1256)
fr: Arabe (cp1256)

source: Baltic languages (cp1257)
fr: Langues baltes (cp1257)

source: Vietnamese (cp1258)
fr: Vietnamien (cp1258)

source: Japanese (euc_jp)
fr: Japonais (euc_jp)

source: Japanese (euc_jis_2004)
fr: Japonais (euc_jis_2004)

source: Japanese (euc_jisx0213)
fr: Japonais (euc_jisx0213)

source: Korean (euc_kr)
fr: Coréen (euc_kr)

source: Simplified Chinese (gb2312)
fr: Chinois simplifié (gb2312)

source: Unified Chinese (gbk)
fr: Chinois unifié (gbk)

source: Unified Chinese (gb18030)
fr: Chinois unifié (gb18030)

source: Simplified Chinese (hz)
fr: Chinois simplifié (hz)

source: Japanese (iso2022_jp)
fr: Japonais (iso2022_jp)

source: Japanese (iso2022_jp_1)
fr: Japonais (iso2022_jp_1)

source: Japanese, Korean, Simplified Chinese, Western Europe, Greek (iso2022_jp_2)
fr: Japonais, Coréen, Chinois simplifié, Europe de l'ouest, Grec (iso2022_jp_2)

source: Japanese (iso2022_jp_2004)
fr: Japonais (iso2022_jp_2004)

source: Japanese (iso2022_jp_3)
fr: Japonais (iso2022_jp_3)

source: Japanese (iso2022_jp_ext)
fr: Japonais (iso2022_jp_ext)

source: Korean (iso2022_kr)
fr: Coréen (iso2022_kr)

source: West Europe (latin_1)
fr: Europe de l'ouest (latin_1)

source: Central and Eastern Europe (iso8859_2)
fr: Europe centrale et de l'est (iso8859_2)

source: Esperanto, Maltese (iso8859_3)
fr: Espéranto, Maltais (iso8859_3)

source: Baltic languages (iso8859_4)
fr: Langues baltes (iso8859_4)

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian (iso8859_5)
fr: Bulgare, Biélorusse, Macédonien, Russe, Serbe (iso8859_5)

source: Arabic (iso8859_6)
fr: Arabe (iso8859_6)

source: Greek (iso8859_7)
fr: Grec (ico8859_7)

source: Hebrew (iso8859_8)
fr: Hébreu (iso8859_8)

source: Turkish (iso8859_9)
fr: Turc (iso8859_9)

source: Nordic languages (iso8859_10)
fr: Langues nordiques (iso8859_10)

source: Baltic languages (iso8859_13)
fr: Langues baltes (iso8859_13)

source: Celtic languages (iso8859_14)
fr: Langues celtes (iso8859_14)

source: Western Europe (iso8859_15)
fr: Europe de l'ouest (iso8859_15)

source: South-Eastern Europe (iso8859_16)
fr: Europe du sud-est (iso8859_16)

source: Korean (johab)
fr: Coréen (johab)

source: Russian (koi8_r)
fr: Russe (kio8_r)

source: Ukrainian (koi8_u)
fr: Ukrainien (kio8_u)

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian (mac_cyrillic)
fr: Bulgare, Biélorusse, Macédonien, Russe, Serbe (mac_cyrillic)

source: Greek (mac_greek)
fr: Grec (mac_greek)

source: Icelandic (mac_iceland)
fr: Islandais (mac_iceland)

source: Central and Eastern Europe (mac_latin2)
fr: Europe centrale et de l'est (mac_latin2)

source: Western Europe (mac_roman)
fr: Europe de l'ouest (mac_roman)

source: Turkish (mac_turkish)
fr: Turc (mac_turkish)

source: Japanese (shift_jis)
fr: Japonais (shift_jis)

source: Japanese (shift_jis_2004)
fr: Japonais (shift_jis_2004)

source: Japanese (shift_jisx0213)
fr: Japonais (shift_jisx0213)

source: all languages (utf_32)
fr: toutes les langues (utf_32)

source: all languages (utf_32_be)
fr: toutes les langues (utf_32_be)

source: all languages (utf_32_le)
fr: toutes les langues (utf_32_le)

source: all languages (utf_16)
fr: toutes les langues (utf_16)

source: all languages (BMP only - utf_16_be)
fr: toutes les langues (BMP uniquement - utf_16_be)

source: all languages (BMP only - utf_16_le)
fr: toutes les langues (BMP uniquement - utf_16_le)

source: all languages (utf_7)
fr: toutes les langues (utf_7)

source: all languages (utf_8)
fr: toutes les langues (utf_8)

source: all languages (utf_8_sig)
fr: toutes les langues (utf_8_sig)

source: Simple text
fr: Texte simple

source: ReStructured text
fr: Texte formatté (ReStructuredText)

source: Markdown text
fr: Texte formatté (Markdown)

source: Inherit from parent?
fr: Hériter du parent ?

source: Don't inherit from parent?
fr: Ne pas hériter du parent ?

source: Selected lexer
fr: Format du code

source: Lexer used to format source code
fr: Lexeur utilisé pour analyser le code source

source: Display line numbers?
fr: Numéros de lignes ?

source: If 'no', line numbers will be hidden
fr: Si 'non', les numéros de lignes ne seront pas affichés

source: Lines wrap?
fr: Sauts de lignes ?

source: If 'yes', lines wraps will be enabled; line numbers will not be displayed if lines wrap is enabled...
fr: Si 'oui', les sauts de lignes automatiques seront activés; les numéros de lignes ne sont pas affichés lorsque les sauts de lignes sont activés...

source: Color style
fr: Style de couleur

source: Selected color style
fr: Feuille de style utilisée pour la mise en forme de la syntaxe

source: Wrong contained type
fr: Type de contenu incorrect.

source: One or more entries of sequence are not unique.
fr: Toutes les entrées de la séquence ne sont pas uniques.

source: Schema not fully implemented
fr: Le schéma n'est pas complètement implémenté.

source: Schema not provided
fr: Le schéma n'est pas fourni.

source: The specified URI is not valid.
fr: L'URL indiquée est invalide ; elle doit comprendre le protocole d'accès au site, comme « http:// » ou « https:// ».

source: The specified id is not valid.
fr: L'identifiant indiqué est invalide.

source: The specified dotted name is not valid.
fr: Le nom indiqué est invalide.

source: The field is not bound.
fr: Le champ n'est pas lié.

source: Required input is missing.
fr: Ce champ est obligatoire.

source: Object is of wrong type.
fr: L'objet est d'un type incorrect.

source: Value is too big
fr: La valeur est trop grande.

source: Value is too small
fr: La valeur est trop petite.

source: Value is too long
fr: La valeur est trop longue.

source: Value is too short
fr: La valeur est trop courte.

source: Invalid value
fr: La valeur est incorrecte.

source: Constraint not satisfied
fr: La contrainte sur ce champ n'est pas satisfaite.

source: Not a container
fr: La valeur fournie n'est pas un conteneur.

source: Not an iterator
fr: La valeur fournie n'est pas un itérateur.

source: Connection name
fr: Nom de la connexion

source: Registration name of ZEO connection
fr: Nom d'inscription dans le registre de la connexion ZEO

source: ZEO server name
fr: Nom du serveur

source: Hostname of ZEO server
fr: Nom DNS (ou adresse IP) du serveur hébergeant la base ZEO

source: ZEO server port
fr: Numéro de port

source: Port number of ZEO server
fr: Numéro du port d'écoute du serveur ZEO

source: ZEO server storage
fr: Stockage

source: Storage name on ZEO server
fr: Nom du stockage correspondant à la base de données

source: ZEO user name
fr: Code utilisateur

source: User name on ZEO server; only for ZEO server before 5.0
fr: Code utilisateur fourni lorsque le serveur demande une authentification; pour les serveurs ZEO avant la version 5.0 uniquement !!

source: ZEO password
fr: Mot de passe

source: User password on ZEO server; only for ZEO server before 5.0
fr: Mot de passe fourni lorsque le serveur demande une authentification; pour les serveurs ZEO avant la version 5.0 uniquement !!

source: ZEO server realm
fr: Domaine

source: Realm name on ZEO server; only for ZEO server before 5.0
fr: Nom du domaine d'authentification ; pour les serveurs ZEO avant la version 5.0 uniquement !!

source: BLOBs directory
fr: Dossier des BLOBs

source: Directory path for blob data
fr: Nom du répertoire dédié au stockage des blobs

source: Shared BLOBs directory ?
fr: Répertoire partagé ?

source: Flag whether the blob_dir is a server-shared filesystem that should be used instead of transferring blob data over zrpc.
fr: Indique si le dossier indiqué pour le stockage des blobs est un répertoire partagé avec le serveur ou non ; dans ce cas, les fichiers seront accédés directement au lieu d'être chargés via ZRPC.

source: Optional renderer label
fr: Libellé optionel du mode de rendu

source: Server timezone
fr: Fuseau horaire du serveur

source: Default server timezone
fr: Fuseau horaire par défaut associé au serveur
