Repository: pypi-data/pypi-mirror-97
Catalog: packages/django-password-policies-iplweb/django-password-policies-iplweb-0.8.3.tar.gz/django-password-policies-iplweb-0.8.3/password_policies/locale/*/LC_MESSAGES/django.po
Languages: ca

source: Force password change for selected users
ca: Força el canvi de contrasenya per als usuaris seleccionats

source: created
ca: creat

source: The date the entry was created.
ca: La data en què es va crear la entrada

source: user
ca: usuari

source: The user who needs to change his/her password.
ca: L'usuari que necessita canviar la seva contrasenya.

source: enforced password change
ca: canvi de contrasenya forçada

source: enforced password changes
ca: canvis de contrasenya forçada

source: password
ca: contrasenya

source: The encrypted password.
ca: La contrasenya encriptada.

source: The user this password history entry belongs to.
ca: L'usuari d'aquesta entrada en l'historial de contrasenyes pertany a.

source: password history entry
ca: entrada en l'historial de contraseñas

source: password history entries
ca: entrades en l'historial de contraseñas

source: The two password fields didn't match.
ca: Les dues contrasenyes no són iguals.

source: The new password was used before. Please enter another one.
ca: La contrasenya nova va ser usada abans. Per favor escrigui una altra nova.

source: New password
ca: Nova contrasenya

source: New password confirmation
ca: Confirmació de contrasenya nova

source: Your old password was entered incorrectly. Please enter it again.
ca: La seva contrasenya anterior és incorrecta. Per favor, escrigui-la de nou

source: The old and the new password are too similar.
ca: La contrasenya anterior i la nova són massa semblants.

source: The old and the new password are the same.
ca: La contrasenya anterior és la mateixa que la contrasenya nova

source: Old password
ca: Contrasenya anterior

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ca: Aquest e-mail no té un compte d'usuari associada. Segur que està registrat?

source: The user account associated with this e-mail address cannot reset the password.
ca: El compte d'usuari associada a aquest e-mail no pot canviar la contrasenya

source: A user with that username already exists.
ca: Ja existeix un usuari amb aquest nom d'usuari.

source: Username
ca: Nom d'usuari

source: Required. 30 characters or fewer. Letters, digits and @/./+/-/_ only.
ca: Obligatori. 30 caràcters o menys. Només lletres, dígits i @/./+/-/_

source: This value may contain only letters, numbers and @/./+/-/_ characters.
ca: Aquest valor només pot contenir lletres, nombres i els caràcters @/./+/-/_

source: Password
ca: Contrasenya

source: Password confirmation
ca: Confirmació de contrasenya

source: Enter the same password as above, for verification.
ca: Entrar a la mateixa contrasenya com a dalt, per verificació.

source: Password new
ca: Contrasenya nova

source: Must change?
ca: Ha de canviar?

source: The new password contains ambiguous bidirectional characters.
ca: La contrasenya nova conté caràcters bidireccionals ambigus.

source: The new password is based on a common sequence of characters.
ca: La contrasenya nova estàs basada en una seqüència comuna de caràcters.

source: The new password contains consecutive characters. Only %(count)d consecutive character is allowed.
ca: La contrasenya nova conté caràcters consecutius. Només es permet %(count)d caràcter consecutiu.

source: Please choose a different password, %s.
ca: Per favor esculli una contrasenya diferent, %s.

source: The new password is not varied enough.
ca: La contrasenya nova no és prou variada.

source: The new password is based on a dictionary word.
ca: La contrasenya nova està basada en una paraula de diccionari.

source: The new password contains invalid unicode characters.
ca: La contrasenya nova conté caràcters invàlids.

source: The new password is similar to an email address.
ca: La contrasenya nova és similar a una adreça de correu electrònic.

source: The new password must contain %d or more number.
ca: La contrasenya nova ha de contenir %d o més números.

source: The new password must contain %d or more symbol.
ca: La contrasenya nova ha de contenir %d o més símbols.
