Repository: pypi-data/pypi-mirror-97
Catalog: packages/pyams-form/pyams_form-1.4.0-py3-none-any.whl/pyams_form/locales/*/LC_MESSAGES/pyams_form.po
Languages: fr

source: The system could not process the given value.
fr: Le système n'a pas pu traiter la valeur fournie.

source: No data was created.
fr: Aucun contenu n'a été créé.

source: Missing filename extension.
fr: L'extension du nom de fichier est absente.

source: The entered value is not a valid integer literal.
fr: La valeur indiquée n'est pas un nombre entier valide.

source: The entered value is not a valid decimal literal.
fr: La valeur indiquée n'est pas un nombre décimal valide.

source: Bytes data are not a file object
fr: Les données binaires ne sont pas des fichiers.

source: There were some errors.
fr: Des erreurs se sont produites.

source: Data successfully updated.
fr: Les modifications ont été enregistrées.

source: No changes were applied.
fr: Aucune modification n'a été effectuée.

source: <span class="required">*</span>&ndash; required
fr: <span class="required">*</span>&ndash; obligatoire

source: Add
fr: Ajouter

source: Apply
fr: Enregistrer

source: yes
fr: oui

source: no
fr: non

source: Missing: ${value}
fr: Valeur manquante : ${value}

source: Field
fr: Champ

source: The schema field which the widget is representing
fr: Le champ du schéma que ce widget représente

source: Name
fr: Nom

source: The name the widget is known under
fr: Le nom sous lequel est connu le widget

source: Label
fr: Libellé

source: The widget label. Label may be translated for the request. The attribute may be implemented as either a read-write or read-only property, depending on the requirements for a specific implementation.
fr: Le libellé du widget. Le libellé peut être traduit pour la requête. L'attribut peut être implémenté comme une propriété en lecture-écriture ou en lecture seule, en fonction des besoins d'unee implémentation spécifique.

source: A widget mode
fr: Mode du widget

source: Required
fr: Obligatoire

source: If true the widget should be displayed as required input
fr: Si 'oui', le widget doit être affiché en tant que champ obligatoire

source: Error
fr: Erreur

source: If an error occurred during any step, the error view stored here
fr: Si une erreur se produit, la vue de l'erreur sera stockée dans cet attribut

source: Value
fr: Valeur

source: The value that the widget represents
fr: La valeur représentée par le widget

source: Ignore Request
fr: Ignorer la requête

source: A flag, when set, forces the widget not to look at the request for a value
fr: Un flag qui, lorsqu'il est positionné, force le widget à ne pas rechercher sa valeur dans la requête

source: Set errors
fr: Activer les erreurs

source: A flag, when set, the widget sets error messages on calling extract()
fr: Ce flag, lorsqu'il est positionné, fait que le widget définit ses erreurs lors de l'appel de la méthode extract()

source: Ignore Required validation
fr: Ignorer les champs obligatoires

source: If set then required fields will pass validation regardless whether they're filled in or not
fr: Si ce flag est positionné, les champs obligatoires passeront la phase de validation qu'ils soient renseignés ou non

source: Show default value
fr: Afficher la valeur par défaut

source: A flag, when set, makes the widget to display field|adapter provided default values
fr: S'il est positionné, ce flag indique au widget d'afficher la valeur par défaut fournie par le champ ou par un adaptateur

source: NO_VALUE Token
fr: Token NO_VALUE

source: The token to be used, if no value has been selected.
fr: Le token à utiliser lorsqu'aucune valeur n'a été sélectionnée.

source: Terms
fr: Termes

source: A component that provides the options for selection
fr: Un composant qui fournit des options de sélection

source: Prompt
fr: Invite

source: A flag, when set, enables a choice explicitely requesting the user to choose a value
fr: Ce flag, lorsqu'il est positionné, active une option demandant explicitement à l'utilisateur de sélectionner une valeur

source: Items
fr: Eléments

source: A collection of dictionaries containing all pieces of information for rendering. The following keys must be in each dictionary: id, value, content, selected
fr: Une collection de dictionnaires contenant toutes les informations nécessaires au rendu. Les clés suivantes doivent être dans chaque entrée du dictionnaire : id, value, content et selected

source: No-Value Message
fr: Message 'pas de valeur'

source: A human-readable text that is displayed to refer the missing value.
fr: Ce texte est affiché pour indiquer une valeur manquante

source: Prompt Message
fr: Message d'invite

source: Prefix
fr: Préfixe

source: The prefix of the widgets
fr: Le préfixe des widgets

source: Errors
fr: Erreurs

source: The collection of errors that occured during validation
fr: La liste des erreurs qui se sont produites pendant la validation

source: Ignore Context
fr: Ignorer le context

source: If set the context is ignored to retrieve a value
fr: Si ce flag est positionné, le contexte courant n'est pas utilisé pour récupérer une valeur

source: If set the request is ignored to retrieve a value
fr: Si ce flag est positionné, la requête n'est pas utilisée pour récupérer une valeur

source: Ignore Readonly
fr: Ignorer les champs en lecture

source: If set then readonly fields will also be shown
fr: S'il est positionné, les champs en lecture seule seront également affichés

source: Ignore Required validation on extract
fr: Ignorer les champs obligatoires

source: If set then required fields will pass validation on extract regardless whether they're filled in or not
fr: S'il est positionné, les champs obligatoires passeront la phase de validation lors de l'extraction des données qu'ils soient renseignés ou non

source: Has required fields
fr: Champs obligatoire ?

source: A flag set when at least one field is marked as required
fr: Un flag positionné lorsque au moins un champ obligatoire est présent

source: A flag, when set, the contained widgets set error messages on calling extract()
fr: Ce flag, lorsqu'il est positionné, indique que les widgets contenus positionnent leurs messages d'erreurs lors de l'extraction

source: The widget for which the event was created.
fr: Le widget pour lequel l'événement a été créé.

source: The widget that the view is on
fr: Le widget sur lequel l'erreur est positionnée

source: Error the view is for
fr: L'erreur pour laquelle la vue a été créée

source: The object name.
fr: Nom de l'objet.

source: Title
fr: Titre

source: The action title.
fr: Le libellé du bouton.

source: The action for which the event is created.
fr: L'action pour laquelle l'événement a été créée.

source: The error that occurred during the action.
fr: L'erreur qui s'est produite pendant le déclenchement de l'action.

source: Access Key
fr: Raccourci

source: The key when pressed causes the button to be pressed
fr: Cette touche lorsqu'elle est pressée active le bouton

source: Action Factory
fr: Fabrique de l'action

source: The action factory
fr: La fabrique de l'action

source: Image Path
fr: URL

source: A relative image path to the root of the resources
fr: Le chemin d'accès à l'image à partir de la racine

source: Handlers
fr: Gestionnaires

source: A list of action handlers defined on the form.
fr: Liste des gestionnaires d'actions définis dans le formulaire.

source: A list of actions defined on the form
fr: Liste des actions définies dans le formulaire

source: Refresh actions
fr: Rafraîchir les actions

source: A flag, when set, causes form actions to be updated again after their execution.
fr: Ce flag, lorsqu'il est positionné, fait que les actions sont mises à jour une nouvelle fois après leur exécution.

source: Context
fr: Contexte

source: The context in which the widget is displayed.
fr: Le contexte dans lequel le widget est affiché.

source: A flag, when set, forces the widget not to look at the context for a value.
fr: Ce flag, lorsqu'il est positionné, force le widget à ne pas rechercher sa valeur dans le contexte.

source: The mode in which to render the widgets.
fr: Le mode de rendu des widgets.

source: If set the context is ignored to retrieve a value.
fr: Si 'oui', le contexte n'est pas utilisé pour récupérer une valeur.

source: If set the request is ignored to retrieve a value.
fr: Si 'oui', la requête n'est pas utilisée pour récupérer une valeur.

source: If set then readonly fields will also be shown.
fr: Si 'oui', les champs en lecture seule sont également affichés.

source: A widget manager containing the widgets to be used in the form.
fr: Un gestionnaire contenant les widgets à utiliser dans le formulaire.

source: A human readable text describing the form that can be used in the UI.
fr: Un texte décrivant le formulaire qui peut être utilisé dans l'interface utilisateur.

source: Label required
fr: Mention obligatoire

source: A human readable text describing the form that can be used in the UI for rendering a required info legend.
fr: un texte qui peut être utilisé dans l'interface utilisateur pour afficher la légende des champs obligatoires.

source: The prefix of the form used to uniquely identify it.
fr: Le préfixe du formulaire est utilisé pour l'identifier de façon unique.

source: Status
fr: Statut

source: The status message of the form.
fr: Mesage de statut du formulaire.

source: The action defines the URI to which the form data are sent.
fr: L'action définit l'URI à laquelle les données du formulaire sont envoyées.

source: The name of the form used to identify it.
fr: Le nom du formulaire est utilisé pour l'identifier.

source: The id of the form used to identify it.
fr: L'ID du formulaire est utilisé pour l'identifier.

source: Method
fr: Méthode

source: The HTTP method used to submit the form.
fr: Méthode HTTP utilisée pour soumettre les données du formulaire.

source: Encoding Type
fr: Encodage

source: The data encoding used to submit the data safely.
fr: Type d'encodage utilisé pour soumettre les données du formulaire.

source: Accepted Character Sets
fr: Jeux de caractères acceptés

source: This is a list of character sets the server accepts. By default this is unknown.
fr: Cette liste indique les jeux de caractères acceptés par le serveur ; par défaut, cette liste est inconnue.

source: Accepted Content Types
fr: Types de contenus acceptés

source: This is a list of content types the server can safely handle.
fr: Liste des types de contenus que le serveur est capable de prendre en charge.

source: Fields
fr: Champs

source: A field manager describing the fields to be used for the form.
fr: Un gestionnaire décrivant les champs utilisés dans le formulaire.

source: Content providers
fr: Fournisseurs de contenus

source: A manager describing the content providers to be used for the form.
fr: Un gestionnaire décrivant les fournisseurs de contenus utilisés dans le formulaire.

source: Buttons
fr: Boutons

source: A button manager describing the buttons to be used for the form.
fr: Un gestionnaire décrivant les boutons utilisés dans le formulaire

source: The context in which the data are validated
fr: Le contexte dans lequel les données sont validées

source: The name of the field within the form
fr: Nom du champ au sein du formulaire

source: Schema Field
fr: Schéma

source: The schema field that is to be rendered
fr: Le champ du schéma qui doit être rendu

source: The prefix of the field used to avoid name clashes
fr: Le préfixe du champ, utilisé pour éviter les conflits de noms

source: The mode in which to render the widget for the field
fr: Le mode dans lequel rendre le widget pour le champ

source: The interface from which the field is coming
fr: L'interface font provient le champ

source: A flag, when set, forces the widget not to look at the context for a value
fr: Ce flag, lorsqu'il est positionné, force le widget à ne pas utiliser le contexte pour rechercher une valeur

source: Widget Factory
fr: Fabrique du widget

source: The widget factory
fr: La fabrique du widget

source: True-value Label
fr: Libellé vrai

source: The label for a true value of the Bool field
fr: Le libellé d'une valeur vraie pour le champ booléen

source: False-value Label
fr: Libellé faux

source: The label for a false value of the Bool field
fr: Le libellé d'une valeur fausse pour le champ booléen

source: Remove selected
fr: Enlever la sélection

source: No value
fr: Pas de valeur sélectionnée

source: Select a value...
fr: Sélectionnez une valeur...
