Repository: pypi-data/pypi-mirror-97
Catalog: packages/m9s-sale-kit/m9s_sale_kit-5.2.1.tar.gz/m9s_sale_kit-5.2.1/locale/*.po
Languages: ca_es, es_es

# error:product.kit.line:
source: The lines of a Kit with the flag "Explode in Sales" checked must to be "Salables".
ca_es: Les línies d'un kit amb la marca "Expandeix a les vendes" han de tenir productes que "Pot ser venut".
es_es: Las líneas de un kit con la marca "Expandir en las ventas" deben tener productos que "Puede ser vendido".

# error:product.product:
source: The product "%s" has the flag "Explode in Sales" checked but not all the products of its lines are "Salables".
ca_es: El producte "%s" té la marca "Expandeix a les vendes" però no tots els productes de les seves línies són "Pot ser venut".
es_es: El producto "%s" tiene la marca "Expandir en las ventas" pero no todos los productos de sus líneas son "Puede ser vendido".

# field:product.product,explode_kit_in_sales:
source: Explode in Sales
ca_es: Expandeix a les vendes
es_es: Expandir en las ventas

# field:product.product,kit_fixed_list_price:
source: Fixed List Price
ca_es: Preu fix
es_es: Precio fijo

# field:sale.line,kit_child_lines:
source: Lines in the kit
ca_es: Línies del kit
es_es: Líneas del kit

# field:sale.line,kit_depth:
source: Depth
ca_es: Profunditat
es_es: Profundidad

# field:sale.line,kit_parent_line:
source: Parent Kit Line
ca_es: Pare de la línia del kit.
es_es: Padre de la línea del kit.

# help:product.product,kit_fixed_list_price:
source: Mark this field if the list price of the kit should be fixed. Do not mark it if the price should be calculated from the sum of the prices of the products in the pack.
ca_es: Marqueu aquest camp si el preu del kit és fix. Si no es marca, el preu es calcularà com la suma dels preus dels productes del kit.
es_es: Marque este campo si el precio del kit es fijo. Si no se marca, el precio se calculará como la suma de los precios de los productos del kit.

# help:sale.line,kit_child_lines:
source: Subcomponents of the kit.
ca_es: Components del kit.
es_es: Componentes del kit.

# help:sale.line,kit_depth:
source: Depth of the line if it is part of a kit.
ca_es: Profunditat de la línia si forma part d'un kit.
es_es: Profundidad de la líniea si forma parte de un kit.

# help:sale.line,kit_parent_line:
source: The kit that contains this product.
ca_es: El kit que conté aquest producte.
es_es: El kit que contiene este producto.
