Repository: pypi-data/pypi-mirror-97
Catalog: packages/m9s-stock-update-planned-date/m9s_stock_update_planned_date-5.2.2.tar.gz/m9s_stock_update_planned_date-5.2.2/locale/*.po
Languages: ca_es

# field:stock.configuration,update_move_in:
source: Update Planned Dates of Purchase Moves
ca_es: Actualitza data estimada moviments de compra

# field:stock.configuration,update_move_out:
source: Update Planned Dates of Sales Moves
ca_es: Actualitza data estimada moviments de venta

# field:stock.configuration,update_move_shipment:
source: Update Planned of Dates Moves
ca_es: Actualitza data estimada moviments

# field:stock.configuration,update_shipment_in:
source: Update Planned Dates of Supplier Shipments
ca_es: Actualitza data estimada albarans de proveïdor

# field:stock.configuration,update_shipment_internal:
source: Update Planned Dates of Internal Shipments
ca_es: Actualitza data estimada albarans interns

# field:stock.configuration,update_shipment_out:
source: Update Planned Dates of Customer Shipments
ca_es: Actualitza data estimada albarans clients

# field:stock.update.planned.date.start,date:
source: Date
ca_es: Data

# model:ir.action,name:wizard_update_planned_date
source: Update Planned Date
ca_es: Actualitza data estimada

# model:ir.cron,name:
source: Update Shipment Out Planned Date
ca_es: Actualitza data estimada d'albarans de sortida

# model:ir.cron,name:cron_update_planned_date_scheduler
source: Update Planned Date
ca_es: Actualitza data estimada

# model:ir.ui.menu,name:menu_update_planned_date
source: Update Planned Date
ca_es: Actualitza data estimada

# model:stock.update.planned.date.start,name:
source: Update Planned Date Start
ca_es: Inici actualitzar data estimada

# view:stock.configuration:
source: Update Planned Date
ca_es: Actualitza data estimada

# view:stock.update.planned.date.start:
source: Update Planned Date
ca_es: Actualitza data estimada

# view:stock.update.planned.date.start:
source: Update Planned Date to
ca_es: Actualitza data estimada a

# wizard_button:stock.update.planned.date,start,end:
source: Cancel
ca_es: Cancel·la

# wizard_button:stock.update.planned.date,start,update_planned_date:
source: OK
ca_es: D'acord
